Repository: NetAngels/voluptuous
Catalog: voluptuous/locale/*/LC_MESSAGES/voluptuous.po
Languages: ru_ru

source: expected {type}
ru_ru: ожидается тип {type}

source: value was not true
ru_ru: Значение не является истиным

source: value was not false
ru_ru: Значение не является ложным

source: expected boolean
ru_ru: ожидается логическое значение

source: no valid value found
ru_ru: не найдено валидное значение

source: expected string or buffer
ru_ru: ожидается строка или буфер

source: does not match regular expression
ru_ru: не соответствует регулярному выражению

source: must have a URL scheme and host
ru_ru: должен иметь схему и имя хоста URL

source: expected an Email
ru_ru: ожидается email

source: Invalid Email
ru_ru: Неправильный email

source: must have a domain name in URL
ru_ru: Должен иметь домен в URL

source: not a file
ru_ru: не файл

source: Not a file
ru_ru: Не файл

source: not a directory
ru_ru: не каталог

source: Not a directory
ru_ru: Не каталог

source: path does not exist
ru_ru: файл не существует

source: Not a Path
ru_ru: Не путь до файла

source: value must be at least {min}
ru_ru: значение должно быть не менее {min}

source: value must be higher than {min}
ru_ru: значение должно быть больше {min}

source: value must be at most {max}
ru_ru: значение должно быть не более {max}

source: value must be lower than {max}
ru_ru: значение должно быть меньше {max}

source: length of value must be at least {min}
ru_ru: длина должна быть не менее {min}

source: length of value must be at most {max}
ru_ru: длина должна быть не более {max}

source: value does not match expected format {format}
ru_ru: значение не соответствует ожидаемому формату {format}

source: value has invalid length expected length {length} ({format})
ru_ru: значение имеет не допустимую длину {length} ({format})

source: value is not allowed
ru_ru: значение не допустимо
